blogger/app/views/articles/show.html.haml

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 13]]
---
  Tags:
  - @article.tags.each do |tag|