blogger/app/controllers/articles_controller.rb

  def show
    @comment = Comment.new
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def create
    # Deprecated by helper function
    # @article = Article.new(
    #   title: params[:article][:title],
    #   body:  params[:article][:body])

    # article params is from `app/helpers/articles_helper.rb`
    # Article doesn't have a tags field (many-many relationship)
    # this causes an error -- added `tag_list=(tags_string)` to article.rb
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "barT"], ["created_at", "2014-06-22 23:47:45.662288"], ["title", "barT"], ["updated_at", "2014-06-22 23:47:45.662288"]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 1