blogger/app/controllers/tags_controller.rb

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 4]]
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 4]]
---
  def destroy
    @tag = Tag.find(params[:id]).destroy